{
  "blogposts": [{
    "title" : "THESE ADIDAS TR-808S ARE GIVING 'KICKS' A WHOLE NEW MEANING",
    "slug": "2017/05/08/blog-post-three",
    "name": "Lorenzo Garcia",
    "shortname" : "Lorenzo_Garcia",
    "body" : "It's time to update your kicks with these TR-808 inspired Adidas sneakers. <br> New York based marketing agency, Neely & Daughters, took it upon themselves to design a pair of Adidas training shoes that essentially create music based off of the original TR-808 drum machine. Right now, these sneakers have only made it to the prototype stage, but it’s another big step towards wearable instruments if executed properly. <br>The most recent prototype featured a USB port, Wi-Fi and Bluetooth capabilities, speakers, volume and tempo control, as well as six programmed beat settings. The idea behind it is really promising and interesting but sadly, these shoes are not available to the general public. Perhaps if enough people were interested then it may one day hit the market but don’t expect that for awhile. Hopefully as time goes on, more and more people will develop and engineer something as enticing as 808 Adidas shoes. Music technology is always evolving and knowing that something like this exists today, makes the future seem a bit more exciting.",
    "description": "It's time to update your kicks with these TR-808 inspired Adidas sneakers.",
    "artwork": "/img/article2.jpg"
  },{
    "title" : "IF STAR WARS CHARACTERS LISTENED TO DANCE MUSIC, THIS IS WHAT THEY'D JAM TO",
    "slug": "2017/05/08/blog-post-two",
    "name": "Hilary Goldywynn Post",
    "shortname" : "Hillary_Goldwynn",
    "body": "Instead of watching the movies for the thousandth time and listening to the soundtrack on repeat, we decided to do something a little different for May the Fourth! To celebrate literally everyone’s favorite movie franchise we decided to explore what EDM songs our favorite Star Wars characters would listen to. We looked at our favorite character and how they act and we determined the best EDM songs for them! Let us know what you think, and your favorite Star Wars song! <br><span>Luke Skywalker - Spaceman by Hardwell</span><br> Luke has always been the clean cut good guy, and he likes to listen to people of a similar nature, and Hardwell is that guy! Luke was fascinated with space since he was a child and just the name of this track resonates with him to the core. He likes the clean house sound, and when he’s ready to go just a little bit harder he’ll turn on the Carnage remix. Catch Luke listening to this one while training with Obi-Wan.<br> <span>Darth Vader - I Know Where I’ve Been by Nicole Moudaber</span><br> Only the darkest, deepest, most epic tracks will do for the most iconic movie villain of all time. Lord Vader will not accept progressive house, and he scoffs at brostep. He needs something as evil as him, and the dark, industrial sound Nicole Moudaber created, is fit for the Sith Lord. Many nights were spent listening to this song on repeat while he works on the Death Star and how to destroy the rebellion.<br> <span>R2D2 and C-3PO - Robot Rock by Daft Punk</span><br> Name a more icon duo then these two droids… I’ll wait. Daft Punk you say? Thats about the closest you can get! Both robotic duos are legends in their own worlds, and R2D2 and C-3PO can relate to the French superstars. It takes a robot to understand a robot and they we’re ecstatic when a rock song was made just for them! Catch them blaring this in the Millennium Falcon while they help shoot down TIE-fighters.",
    "description": "Instead of watching the movies for the thousandth time and listening to the soundtrack on repeat, we decided to do something a little different for May the Fourth! To celebrate literally everyone’s favorite movie franchise we decided to explore what EDM songs our favorite Star Wars characters would listen to. We looked at our favorite character and how they act and we determined the best EDM songs for them! Let us know what you think, and your favorite Star Wars song!",
    "artwork" : "/img/article1.jpg"
  },{
    "title" : "DREAMS DO COME TRUE! DISNEYLAND ANNOUNCES NEW EDM FESTIVAL, ELECTROLAND",
    "slug": "2017/05/08/blog-post-one",
    "name": "Riley Rudolph Rewington",
    "shortname" : "Riley_Rewington",
    "body": "To commemorate Disneyland Paris’ 25th year, they decided to shake things up a bit by throwing the company’s first ever electronic music festival.<br> Taking place July 8th, 10,000 attendees will be hitting the rides all night while listening to world class artists and partying with Mickey Mouse himself, making the most magical place on earth all the more magical! Disneyland has already dropped the lineup withSteve Aoki, NERVO, Michael Calfan, and Richard Orlinsk headlining this rare event. More artists will be announced as the festival date starts to approach. <br>What should we expect as this family oriented theme park takes a turn to the wild side? What we know so far is that there will be normal festival LED screens with the addition of projection mapping onto The Twilight Zone Tower of Terror ride. The amusement park’s rides will be open for when you need a little more thrill. And there will be bars and restaurants throughout the park serving your favorite refreshments and treats. <br>One thing we can say is that the Walt Disney Company is notorious for making all of their events seem like something out of a dream. This festival is guaranteed to be one for the books. Tickets are already on sale with both a standard and a privilege option. A general admission ticket to the festival will cost you around $74 USD. <br>Head over to Ticketmaster to secure tickets to the ultimate fantasy festival experience of a lifetime, Disney’s Electroland.",
    "description": "To commemorate Disneyland Paris’ 25th year, they decided to shake things up a bit by throwing the company’s first ever electronic music festival.",
    "artwork" : "/img/article3.jpg"
  }]
}
